Revit 2026 API

# ProjectionMethod Enumeration

---

Projection method

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ProjectionMethod
```
```vb
Public Enumeration ProjectionMethod
```
```cpp
public enum class ProjectionMethod
```
```fsharp
type ProjectionMethod
```

| Member name | Value | Description |
| --- | --- | --- |
| Orthographic | 0 | Orthographic |
| Perspective | 1 | Perspective |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace